Repository: WordPressBugBounty/plugins-decimal-product-quantity-for-woocommerce
Catalog: decimal-product-quantity-for-woocommerce/languages/decimal-product-quantity-for-woocommerce-*.po
Languages: ru_ru

source: Decimal Product Quantity for WooCommerce. (Piece of Product). Min, Max, Step & Default preset. Variable Products Supported. Auto correction "No valid value". Update Cart Automatically on Quantity Change (AJAX Cart Update). Read about <a href="http://wpgear.xyz/decimal-product-quantity-woo-pro/">PRO Version</a> for separate Minimum Quantity, Step of Changing & Default preset Quantity - for each Product Variation. Create XML/RSS Feed for WooCommerce. Support: "Google Merchant Center" (Product data specification) whith "Price_Unit_Label" -> [unit_pricing_measure], separate hierarchy Categories -> Products.
ru_ru: Дробные Количества Товаров для WooCommerce. (Товар по частям). Минимум, Максимум, Шаг изменения количества и Начальное значение. Работа с Вариативными Товарами. Автокоррекция "Неправильное значение". Автообновление Корзины при изменении Количества (AJAX Cart Update). Посмотрите подробности <a href="http://wpgear.xyz/decimal-product-quantity-woo-pro\">PRO Версии</a> для гибких возможностей с отдельными Вариациями Товара. Поддержка XML/RSS Feed для Товаров, с учетом требований: "Google Merchant Center" (Product data specification) в том числе "Price_Unit_Label" -> [unit_pricing_measure], раздельно для иерархий Категории -> Товары.

source: You have exceeded the allowed Maximum Quantity for this product. Check Cart.
ru_ru: Вы превысили максимально допустимое количество для этого Товара.

source: - No valid value. Auto correction nearest valid value:
ru_ru: - Некорректное значение. Автокоррекция до ближайшего правильного:

source: - More than the maximum allowed for this Product. Auto correction to Max:
ru_ru: - Больше, чем допустимо для данного Товара. Автокоррекция до Максимума:

source: Will be available after creating the Cart
ru_ru: Будет доступно после создания Корзины

source: Create Cart
ru_ru: Создать Корзину

source: These Products were in your previous Cart. You can "Create Cart" based on them.
ru_ru: Эти товары были в вашей предыдущей Корзине. Можно "Создать Корзину" на их основе.

source: Correct processing of coupons is possible only in the Pro version "Decimal Product Quantity for WooCommerce". Sorry.
ru_ru: Корректная обработка Купонов возможна толька в PRO версии "Decimal Product Quantity for WooCommerce". Извините.

source: The current version of the plugin "Decimal Product Quantity for Woocommerce" will not work correctly if the pages: Cart, Checkout, Order - have a block structure. Check the Pages:
ru_ru: Текущая версия плагина "Decimal Product Quantity for Woocommerce" не будет работать корректно, если Страницы: Cart, Checkout, Order - имеют Блочную Структуру. Проверьте Страницы:

source: In stock
ru_ru: В наличии

source: Quantity
ru_ru: Количество

source: Min:
ru_ru: Мин:

source: Max:
ru_ru: Макс:

source: Step:
ru_ru: Шаг:

source: Set:
ru_ru: Нач:

source: Disabled in Global Option.
ru_ru: Отключено в Основных Настройках.

source: Decimal Quantity
ru_ru: Дробные Количества

source: This Options will be shown for all Products in this Category.
ru_ru: Эти Настройки будут использованы для всех Товаров из этой Категории.

source: But each Product can have its own Options.
ru_ru: Но каждый Товар может иметь свои собственные Настройки.

source: Price Unit-Label
ru_ru: Метка Ценника

source: Sample: "Price per Kg." / "Price per Meter". Or leave blank.
ru_ru: Например: "Цена за Кг." / "Цена за Метр". Или оставьте пустым.

source: Min Quantity
ru_ru: Мин. Кол-во

source: Max Quantity
ru_ru: Макс. Кол-во

source: Step Quantity
ru_ru: Шаг изменения Кол-ва

source: Default set Quantity
ru_ru: Начальное Кол-во

source: Sample (Min,Max,Step,Set): 1 or 0.1 or 0.25 or 1.5 etc.
ru_ru: Например (Мин,Макс,Шаг,Нач): 1 или 0.1 или 0.25 или 1.5 и.т.д.

source: or leave blank for
ru_ru: или оставьте пустым, и будут

source: General Settings
ru_ru: Основные Настройки

source: * PRO Version only!
ru_ru: * для PRO Версии!

source: Quantity Options
ru_ru: Опции Количества

source: * If not specified, it will be as in
ru_ru: * Если не задано, то используются настройки из

source: Minimum
ru_ru: Минимум

source: Set the Min of changing the quantity: 0.1 0.5 100 e.t.c (Default =
ru_ru: Минимально допустимое значение для изменения количества. Например: 0.1 0.5 100 и.т.д. (По умолчанию =

source: Default Set
ru_ru: Начальное значение

source: Set the Default quantity: 0.1 0.5 100 e.t.c (Default =
ru_ru: Начальное значение количества. Например: 0.1 0.5 100 и.т.д. (По умолчанию =

source: Step change +/-
ru_ru: Шаг изменения */-

source: Set the Step of changing the quantity: 0.1 0.5 100 e.t.c (Default =
ru_ru: Шаг для изменения количества. Например: 0.1 0.5 100 и.т.д. (По умолчанию =

source: Maximum
ru_ru: Максимум

source: Set the Max of changing the quantity: 0.1 0.5 100 e.t.c (or leave blank)
ru_ru: Минимально допустимое значение для изменения количества. Например: 0.1 0.5 100 и.т.д. (Или оставьте пустым)

source: View Price Unit-Label. Sample: "Price per Kg." / "Price per Meter". Or leave blank to use Category value.
ru_ru: "Метка Ценника". Например: "Цена за Кг" / "Цена за Метр". Или оставьте пустым, будут использоваться Настройки из Категории или Основных Настроек.

source: Disable Price Unit-Label
ru_ru: Откл. Метку Ценника

source: Disable Price Unit-Label for this Product.
ru_ru: Отключить "Метку Ценника" для данного Товара.

source: Disable RSS Feed
ru_ru: Отключить RSS Feed

source: Disable RSS Feed for this Product.
ru_ru: Отключить RSS Feed для данного Товара.

source: Min cart Quantity (if the variation has a separate value)
ru_ru: Минимальное Кол-во (если вариация имеет раздельное значение)

source: Step change Quantity (if the variation has a separate value)
ru_ru: Шаг изменения Кол-ва (если вариация имеет раздельное значение)

source: Default Quantity (if the variation has a separate value)
ru_ru: Начальное Кол-во (если вариация имеет раздельное значение)

source: Max cart Quantity (if the variation has a separate value)
ru_ru: Максимальное Кол-во (если вариация имеет раздельное значение)

source: This section shows information about Ext. Data.
ru_ru: В этом разделе показана информация о доп. Данных.

source: Displays is defined constant Session. For WPGear support.
ru_ru: Отображает системные константы Сессии. Для поддержки WPGear.

source: Warning! Data Incorrect. Update Disable.
ru_ru: Внимание! Данные некорректны. Обновление отключено.

source: Not a Valid Number. Set = 1
ru_ru: Неправильное Значение. Изменено на 1

source: Not a Valid Number. Set = empty
ru_ru: Неправильное Значение. Оставлено пустым

source: Set = Min
ru_ru: Изменено на Мин.

source: Set = Max
ru_ru: Изменено на Макс.

source: Step change Quantity
ru_ru: Шаг изменения Кол-ва

source: Set = Default
ru_ru: Изменено на Начальное Кол-во.

source: Warning!
ru_ru: Внимание!

source: Check this Settings.
ru_ru: Проверьте изменения.

source: * Each Product and each Category can set a custom value.
ru_ru: * Каждый Товар и каждая Категория могут иметь свои собственные значения.

source: General:
ru_ru: Общие Параметры:

source: How min-much quantity of product to cart
ru_ru: Минимальное количество товара для покупки

source: 1 or 0.1 or 0.25 or 1.5 etc.
ru_ru: 1 или 0.1 или 0.25 или 1.5 и.т.д.

source: How max-much quantity of product to cart
ru_ru: Максимальное количество товара для покупки

source: 1 or 0.1 or 0.25 or 1.5 etc. Or leave blank
ru_ru: 1 или 0.1 или 0.25 или 1.5 и.т.д. Или оставьте пустым

source: How much to increase or decrease the quantity of product to cart
ru_ru: Шаг изменения количества товара для покупки

source: How much default quantity of product to cart
ru_ru: Начальное количество товара для покупки

source: Buttons [Plus / Minus]:
ru_ru: Кнопки [Плюс / Минус]

source: Product
ru_ru: Товар

source: Enable Buttons [ + / - ] for Product
ru_ru: Включить Кнопки [ + / - ] для Товаров

source: Cart
ru_ru: Корзина

source: Enable Buttons [ + / - ] for Cart
ru_ru: Включить Кнопки [ + / - ] для Корзины

source: Advanced:
ru_ru: Дополнительно:

source: Enable "Price Unit-Label" (Kg, Liter, Meter, Piece, etc.) On/Off
ru_ru: Включить "Метку Ценника" (Кг, Литр, Метр, Кусок, итд.) Вкл/Откл

source: Auto correction
ru_ru: Авто - Коррекция

source: Correction "No valid Value" customer enters to nearest valid value Quantity. On/Off
ru_ru: Автокоррекция неправильно введенного значения [Количество] до ближайшего правильного. Вкл/Откл

source: Auto update Cart
ru_ru: Автообновление Корзины

source: Auto update Cart if change Quantity (AJAX Cart Update) On/Off
ru_ru: Автообновление Корзины при изменении Количества (AJAX Cart Update) Вкл/Откл

source: Enable WooCommerce RSS Feed. On/Off
ru_ru: Включить WooCommerce RSS Feed. Вкл/Откл

source: Support: "Google Merchant Center" -> "Price_Unit_Label as [unit_pricing_measure]
ru_ru: Поддержка: "Google Merchant Center" (Product data specification) с учетом "Price_Unit_Label", раздельно по Иерархии Категории -> Товары

source: Link for RSS Feed. (Default: products)
ru_ru: Ссылка для RSS Feed. (По умолчанию: products)

source: Debugging:
ru_ru: Отладчик:

source: Debug info
ru_ru: Отладочная инф.

source: View Debug info in Browser Console. On/Off
ru_ru: Показывать Отладочную информацию в Консоли Браузера. Вкл/Откл

source: Cart Storage type:
ru_ru: Тип Хранилища для Корзины:

source: Choose if Caching on Hosting is used. (Cart Data can be saved after the browser is closed).
ru_ru: Выбирайте, если используется Кэширование на хостинге. (Данные в Корзине могут быть сохранены после закрытия Браузера).

source: Choose if your users can use Public Terminals. (Cart Data deleted after the browser closed).
ru_ru: Выбирайте, если ваши Пользователи могут использовать Публичные Интернет - Киоски. (Данные в Корзине удаляются после закрытия Браузера).

source: Clearing:
ru_ru: Очистка:

source: Clearing
ru_ru: Очитка данных

source: Delete Quantity-MetaData with Uninstall Plugin. On/Off
ru_ru: Удалять Мета-Данные при Удалении Плагина. Вкл/Откл

source: Save
ru_ru: Сохранить
